package day14;

/*
 	과제 주제 : 자유 주제로 CRUD 프로그램 구현 하기  , 게시판X
 	[ 조건 ] 
		1. MVC 디자인 패턴 사용  ( 로그인상태는 controller ) 
		2. 싱글톤 디자인 패턴 사용
		3. ArrayList 클래스 사용
		4. C(저장)R(출력)U(수정)D(삭제)
	[ 설계 순서 ]	, 캡처 해서 카톡방에 제출 
		https://app.diagrams.net/
		1. 선정한 주제에 따른 FLOW CHART 그리기 , 화살표로 흐름도 표현 
		2. 선정한 주제에 따른 클래스 다이어그램 작성하기 , 함수의 매개변수/반환타입 , +public -private
	[ 구현 순서 ] , 코드 구현 git 링크 제출 
		1. 패키지 구성 
		2. 클래스 만들기 (클래스 내부 코드 추후에 작성)
		3. DTO클래스 먼저 코드 구현하기
		4. 싱글톤 패턴을 사용할 클래스들에 싱글톤 코드 작성 
		5. 기능별 VIEW -> CONTROLLER -> DAO 순서대로 함수 구현
	[ 2인 ]
	진석	희만				
	은서	상범				홍빈	강사
		민우 예나
	도하	민진 웅재
*/

public class Example2 {}








